#Реализовать алгоритм задания случайных чисел.
# Без использования встроенного генератора псевдослучайных чисел
import random
import math

i = int(input())
print(i)
def alg(n, nums):
    num.append()



random.seed(6)

