#Найти сумму чисел списка стоящих на нечетной позиции
a = [1, 2, 8, 10, 25,0, 1]
i = 0
sum = 0
while i < len(a)+1:
    if i % 2 == 0:
        sum = sum + a[i]
    i+=1
print(sum)