#Написать программу преобразования десятичного числа в двоичное
a = 13
print(bin(a))

print(format(a, 'b'))

